In [1]:
%load_ext sql
%sql postgresql://postgres:123@localhost/sakila

In [2]:
%%sql
-- Kiralanan güne 5 gün ekleme
SELECT
    rental_date,
    rental_date + INTERVAL '5 day' AS rental_date2
FROM rental
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[(datetime.datetime(2022, 5, 25, 0, 54, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 30, 0, 54, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 5, 25, 1, 3, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 30, 1, 3, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 5, 25, 1, 4, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 30, 1, 4, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 5, 25, 1, 5, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 30, 1, 5, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 5, 25, 1, 8, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 30, 1, 8, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

In [3]:
%%sql
-- İade edilen güne 1 saat ekleme
SELECT
    return_date,
    return_date + INTERVAL '1 hour'   AS return_date2
FROM rental
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[(datetime.datetime(2022, 5, 28, 21, 40, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 28, 22, 40, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 6, 2, 0, 12, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 6, 2, 1, 12, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 6, 3, 3, 43, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 6, 3, 4, 43, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 6, 2, 6, 33, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 6, 2, 7, 33, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (datetime.datetime(2022, 5, 27, 3, 32, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2022, 5, 27, 4, 32, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

In [4]:
%%sql
-- Kiralama süresi
SELECT 
    return_date - rental_date AS days_rented
FROM rental
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[(datetime.timedelta(days=3, seconds=74760),),
 (datetime.timedelta(days=7, seconds=83340),),
 (datetime.timedelta(days=9, seconds=9540),),
 (datetime.timedelta(days=8, seconds=19680),),
 (datetime.timedelta(days=2, seconds=8640),),
 (datetime.timedelta(days=4, seconds=76980),),
 (datetime.timedelta(days=3, seconds=120),),
 (datetime.timedelta(days=3, seconds=1320),),
 (datetime.timedelta(days=6, seconds=81720),),
 (datetime.timedelta(days=8, seconds=74820),)]

In [5]:
%%sql
-- Kiralama süresi
SELECT 
    AGE(return_date, rental_date) AS days_rented
FROM rental
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[(datetime.timedelta(days=3, seconds=74760),),
 (datetime.timedelta(days=7, seconds=83340),),
 (datetime.timedelta(days=9, seconds=9540),),
 (datetime.timedelta(days=8, seconds=19680),),
 (datetime.timedelta(days=2, seconds=8640),),
 (datetime.timedelta(days=4, seconds=76980),),
 (datetime.timedelta(days=3, seconds=120),),
 (datetime.timedelta(days=3, seconds=1320),),
 (datetime.timedelta(days=6, seconds=81720),),
 (datetime.timedelta(days=8, seconds=74820),)]

In [6]:
%%sql
SELECT NOW();

 * postgresql://postgres:***@localhost/sakila
1 rows affected.

[(datetime.datetime(2022, 8, 27, 22, 20, 57, 872157, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),)]

In [7]:
%%sql
SELECT CURRENT_TIMESTAMP;

 * postgresql://postgres:***@localhost/sakila
1 rows affected.

[(datetime.datetime(2022, 8, 27, 22, 20, 57, 887951, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),)]

In [8]:
%%sql
SELECT
    CURRENT_TIMESTAMP :: timestamp AS right_now,
    (INTERVAL '3 day'  + CURRENT_TIMESTAMP) :: timestamp AS three_days_from_now;

 * postgresql://postgres:***@localhost/sakila
1 rows affected.

[(datetime.datetime(2022, 8, 27, 22, 20, 57, 905412), datetime.datetime(2022, 8, 30, 22, 20, 57, 905412))]

In [9]:
%%sql
SELECT CURRENT_DATE;

 * postgresql://postgres:***@localhost/sakila
1 rows affected.

[(datetime.date(2022, 8, 27),)]

In [10]:
%%sql
SELECT CURRENT_TIME;

 * postgresql://postgres:***@localhost/sakila
1 rows affected.

[(datetime.time(22, 20, 57, 934555, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),)]

In [11]:
%%sql
-- Kiralanan haftanın günü
SELECT
  EXTRACT(dow from rental_date) AS dayofweek 
FROM rental 
LIMIT 20;

 * postgresql://postgres:***@localhost/sakila
20 rows affected.

[(Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),),
 (Decimal('3'),)]

In [12]:
%%sql
-- Kiralanan haftanın gününe göre kiralama sayıları
SELECT 
    EXTRACT(dow FROM rental_date) AS dayofweek,
    COUNT(*) as rentals 
FROM rental 
GROUP BY 1
ORDER BY 1;

 * postgresql://postgres:***@localhost/sakila
7 rows affected.

[(Decimal('0'), 2330),
 (Decimal('1'), 2408),
 (Decimal('2'), 2295),
 (Decimal('3'), 2214),
 (Decimal('4'), 2218),
 (Decimal('5'), 2256),
 (Decimal('6'), 2323)]

In [13]:
%%sql
-- 1 Şubat 2022 ile 21 Şubat 2022 arasında kiralamalar
SELECT 
    EXTRACT(dow FROM rental_date) AS dayofweek,
    COALESCE(AGE(return_date, rental_date)::text,'Not Returned') AS rental_days
FROM rental AS r 
WHERE 
    rental_date BETWEEN '2022-02-01'::date
    AND '2022-02-01'::date+ INTERVAL '30 day'
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[(Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned'),
 (Decimal('1'), 'Not Returned')]

In [14]:
%%sql
SELECT 
    rental_date,
    EXTRACT(dow FROM rental_date) AS rental_dayofweek,
    AGE(return_date, rental_date) AS rental_days
FROM rental AS r
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[(datetime.datetime(2022, 5, 25, 0, 54, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=3, seconds=74760)),
 (datetime.datetime(2022, 5, 25, 1, 3, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=7, seconds=83340)),
 (datetime.datetime(2022, 5, 25, 1, 4, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=9, seconds=9540)),
 (datetime.datetime(2022, 5, 25, 1, 5, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=8, seconds=19680)),
 (datetime.datetime(2022, 5, 25, 1, 8, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=2, seconds=8640)),
 (datetime.datetime(2022, 5, 25, 1, 11, 53, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=4, seconds=76980)),
 (datetime.datetime(2022, 5, 25, 1, 31, 46, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=3, seconds=120)),
 (datetime.datetime(2022, 5, 25, 2, 0, 40, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=3, seconds=1320)),
 (datetime.datetime(2022, 5, 25, 2, 2, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=6, seconds=81720)),
 (datetime.datetime(2022, 5, 25, 2, 9, 2, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('3'), datetime.timedelta(days=8, seconds=74820))]

In [15]:
%%sql
-- Aynı ayda yapılan kiraları birleştirebilmek için kiralama tarihlerinin ay seviyesine kesildi.
SELECT DATE_TRUNC('month', rental_date) AS rental_month
FROM rental
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[(datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))),)]

In [16]:
%%sql
-- Aylara göre yapılan kiralama sayıları
SELECT 
    DATE_TRUNC('month', rental_date) AS rental_month,
    COUNT(*) AS rentals 
FROM rental
GROUP BY 1
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[(datetime.datetime(2022, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 182),
 (datetime.datetime(2022, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 6665),
 (datetime.datetime(2022, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 5730),
 (datetime.datetime(2022, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 2314),
 (datetime.datetime(2022, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1153)]